package view

/*//                       --== TODO ==--
          не пишем говнокод а вместо этого
1. Включить голову
2. Включить критическое мышление
3. Проверить пп 1 и 2 еще раз
4. Перенести и переписать код из пакета parser в пакет view
5. убрать все слова с 'parse' - мы ничего не парсим - мы просто готовим представление
6. не логируем нигде кроме верехнеуровнего API
7. отправляем внятные ошибки, чтобы было понятно что явилось причиний и где
                         ==-- И ловим КАЙФ --==
*/
